#+TITLE: 有意思的概率计算

* 掷骰子的数学

简单起见，笔者这里以掷硬币为例，如果硬币是正常的，那么每次投掷硬币，硬币正反面的概率都是
$\frac{1}{2}$, 于是，在投掷 $N$ 次后，我们可以计算投掷硬币的总的期望值 (正面为 1， 反面为 0):

\begin{equation}
    E(X_A) = \sum_i^N (\frac{1}{2} \times 1 + \frac{1}{2}\times 0) = \frac{N}{2}
\end{equation}


#+BEGIN_QUOTE
一般地，给定一个样本空间 S 和事件 A, 我们定义 A 为指示器随机变量，如果其满足
\begin{equation}
    I(A) = \left\{
    \begin{array}{l}
    1, \quad \text{if A happen}\\
    0, \quad \text{if A does not happend}
    \end{array}
\end{equation}
#+END_QUOTE

对于投掷硬币，每次硬币出现正面或者反面，这样的事情无疑属于指示器随机变量，回到投掷色子，这样的事件一
样是指示器随机变量，不过，此时，如果我们想要计算投掷 $N$ 次色子，得到的总点数，就需要做一个简单变形，
即

\begin{aligned}
    E(TotalPoints) &= \sum_i^N(Point \times Pr(Point))\\
    &= 1\times\frac{1}{6} + 2\times\frac{1}{6} \ldots + 6 \times \frac{1}{6}\\
    &= 3.5
\end{aligned}

如果色盅里有三个色子，三个色子彼此是独立的，每次摇色盅，相当于投掷三次色子，于是相应的期望值为
$3.5\times 3 = 10.5$. 台面上与期望值 10.5 最接近的无疑是 9, 10, 11, 12, 当然，如果读者感兴趣的话，完
全可以计算色子投掷的标准差，计算起来也比较方便，利用 $\sigma^2 = E(X^2) - E(\bar{X})^2$ 来计算。 笔
者偷懒，直接用 ~numpy~ 计算了

#+BEGIN_SRC python
import numpy as np

arr = np.arange(1, 7)
print(arr.std())
print(10.5 - arr.std())
print(10.5 + arr.std())
#+END_SRC

#+RESULTS:
: 1.707825127659933
: 8.792174872340066
: 12.207825127659934

考虑到大数定律，色子落在 9 ~ 12 的概率，大约到 60%，无疑，这样的概率已经很大的了，笔者在其他区域乱投注，输了也
是活该！

